#+TITLE: RacketCon 2025 - Session Summary
#+AUTHOR: Claude & Jason Walsh
#+DATE: Saturday, October 4th, 2025
#+STARTUP: overview

* Commits Summary

#+begin_src bash :results output
git log --oneline -15
#+end_src

#+RESULTS:
| c71d976 | feat(status):       | replace markdown with org-mode status tracking           |
| 00f744c | docs(experiments):  | add comprehensive experiment status tracking             |
| 624e3a5 | feat(experiments):  | add Makefiles for experiments 000, 001, 048, 061        |
| 0cdff58 | feat(experiments):  | add Makefiles and Geiser experiments                     |
| c7bf925 | docs(045-lenses):   | add getting started guide                                |
| 410eb98 | feat(045-lenses):   | add Makefile for testing and verification                |
| dfcc20b | docs(rhea):         | add experiment assignment tracking                       |
| 64a5d9d | feat(rhea):         | implement RHEA framework in Racket/Guile/Python          |
| 9275d30 | feat(emacs):        | add comprehensive Emacs tooling for experiments          |
| 068581f | feat(lenses):       | add Maybe prism implementation and t-shirt doc           |
| c18865a | docs(sessions):     | add Sunday RacketCon sessions                            |

